pollux_back_end/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE (username = NULL OR email = 'felixkim09@gmail.com') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def find_user_by_username_or_email(username, email)
        sql = 'username = :username OR email = :email'
        User.where(sql, username: username, email: email).first