pollux_back_end/app/controllers/users_controller.rb

  def register
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "first_name", "last_name", "email", "phone_number", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "phone_number" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["phone_number", "6368490000"], ["updated_at", "2024-04-27 20:31:22.817948"], ["id", 1]]